[{"id":1,"type":"theory","index":"Что такое HTML и CSS? Для чего они нужны?  ","comment":"HTML -  расшифровывается как HyperText Markup Language (язык гипертекстовой разметки). Это язык разметки документов во Всемирной паутине (World Wide Web, WWW). HTML &mdash; это стандартизированный язык, позволяющий составлять форматированный текст. Браузер интерпретирует его и отображает на экране элементы веб-страниц.\r\nCSS -  (англ. Cascading Style Sheets) это каскадные таблицы стилей. Этот язык разметки определяет, как HTML-элементы веб-сайта должны отображаться на интерфейсе страницы.\r\nHTML применяется для разметки веб-страниц. Она нужна браузерам, которые преобразуют гипертекст и выводят на экран страницу в удобном для человека формате. А CSS описывает внешний вид HTML-элементов. То есть разработчики с помощью каскадных таблиц стилей определяют, как должен выглядеть тот или иной элемент на странице."},{"id":2,"type":"theory","index":"Какие основные HTML теги входят в базисный шаблон?","comment":"&lt;!DOCTYPE html&gt;\r\n&lt;html lang=&quot;ru&quot;&gt;\r\n&lt;head&gt;\r\n  &lt;meta charset=&quot;UTF-8&quot;&gt;\r\n  &lt;title&gt;Моя первая страница&lt;\/title&gt;\r\n&lt;\/head&gt;\r\n&lt;body&gt;\r\n&lt;\/body&gt;\r\n&lt;\/html&gt;"},{"id":3,"type":"theory","index":"ЧТО ТАКОЕ  PHP?","comment":"PHP (Hypertext Preprocessor) - это скриптовый язык общего назначения, интенсивно применяемый для разработки веб-приложений."},{"id":4,"type":"theory","index":"ЧТО ТАКОЕ PEAR В PHP?","comment":"PEAR - это фреймворк и репозиторий для многоразовых компонентов PHP . PEAR расшифровывается как PHP Extension and Application Repository . Он содержит все типы фрагментов и библиотек PHP-кода.\r\nОн также предоставляет интерфейс командной строки для автоматической установки &laquo;пакетов&raquo;."},{"id":5,"type":"theory","index":"КТО ИЗВЕСТЕН КАК ОТЕЦ PHP?","comment":"Расмус Лердорф"},{"id":6,"type":"theory","index":"КАК БЫЛО СТАРОЕ НАЗВАНИЕ PHP?","comment":"Старое название PHP было Personal Home Page."},{"id":7,"type":"theory","index":"КАК НАЗЫВАЕТСЯ СКРИПТОВЫЙ ДВИЖОК В PHP?","comment":"Механизм сценариев, на котором работает PHP, называется Zend Engine 2 ."},{"id":8,"type":"theory","index":"КАКИЕ ПОПУЛЯРНЫЕ СИСТЕМЫ УПРАВЛЕНИЯ КОНТЕНТОМ (CMS) В PHP?","comment":"&bull;\tWordPress - это бесплатная система управления контентом (CMS) с откры-тым исходным кодом, основанная на PHP и MySQL. Он включает в себя архитектуру плагинов и систему шаблонов. Он в основном связан с ведением блогов, но поддержи-вает другой вид веб-контента, содержащий более традиционные списки рассылки и фо-румы, медиа-дисплеи и интернет-магазины.\r\n&bull;\tJoomla - это бесплатная система управления контентом с открытым исходным кодом (CMS) для распространения веб-контента, созданная Open Source Matters, Inc. Она основана на структуре веб-приложений модель-представление-контроллер, которую можно использовать независимо от CMS. .\r\n&bull;\tMagento - это программа для электронной торговли с открытым исходным ко-дом, разработанная Varien Inc., ценная для онлайн-бизнеса. Он имеет гибкий измери-тельный дизайн и универсален с множеством альтернативных вариантов управления, полезных для клиентов. Magento использует этап электронной торговли, который пред-лагает организацию экстремального электронного бизнеса и обширную сеть поддержки.\r\n&bull;\tDrupal - это платформа CMS, разработанная на PHP и распространяемая под GNU (General Public License)."},{"id":9,"type":"theory","index":"КАКИЕ ФРЕЙМВОРКИ НАИБОЛЕЕ ПОПУЛЯРНЫ В PHP?","comment":"&bull;\tLaravel\r\n&bull;\tCakePHP\r\n&bull;\tCodeIgniter\r\n&bull;\tYii 2\r\n&bull;\tSymfony\r\n&bull;\tZend Framework и т. Д."},{"id":10,"type":"theory","index":"НА КАКОЙ ЯЗЫК ПРОГРАММИРОВАНИЯ ПОХОЖ PHP?","comment":"Синтаксис PHP позаимствован у Perl и C."},{"id":11,"type":"theory","index":"ПЕРЕЧИСЛИТЕ НЕКОТОРЫЕ ОСОБЕННОСТИ PHP7.","comment":"&bull;\tОбъявления скалярных типов\r\n&bull;\tОбъявления типа возврата\r\n&bull;\tОператор объединения с нулевым значением (??)\r\n&bull;\tОператор космического корабля   &ldquo;&lt;=&gt;&rdquo;  (spaceship)\r\n&bull;\tПостоянные массивы с использованием define ()\r\n&bull;\tАнонимные классы\r\n&bull;\tClosure :: call метод\r\n&bull;\tОбъявление группового использования\r\n&bull;\tВыражения возврата генератора\r\n&bull;\tДелегирование генератора"},{"id":12,"type":"theory","index":"Язык PHP интерпретируемый или компилируемый?","comment":"PHP входит в число языков с динамической типизацией. Это значит, что тип данных определяется не при объявлении переменной, а при присваивании значения.  PHP &mdash; интерпретируемый язык. Написанные на нём программы интерпретируются в момент обращения с помощью специальных программ. Интерпретируемые языки не зависят от платформы, но уступают компилируемым языкам в скорости исполнения"},{"id":13,"type":"theory","index":" Файлы с каким расширением index.* будут исполнятся как PHP  код? ","comment":"Пишем тут свой пост"},{"id":14,"type":"theory","index":"с какого момента в  файле код начнет исполнятся как PHP?","comment":"&lt;?php &lsquo;echo в этих тегах только будет исполнятся php код в html странице&rsquo;; ?&gt;"},{"id":15,"type":"theory","index":"Сколько и какие типы данных есть в PHP?","comment":"PHP поддерживает десять простых типов.\r\nЧетыре скалярных типа:\r\n    &bull; bool\r\n    &bull; int\r\n    &bull; float (число с плавающей точкой, также известное как double)\r\n    &bull; string\r\nЧетыре смешанных типа:\r\n    &bull; array\r\n    &bull; object\r\n    &bull; callable\r\n    &bull; iterable\r\nИ, наконец, два специальных типа:\r\n    &bull; resource\r\n    &bull; NULL"},{"id":16,"type":"theory","index":"Какой вид типизации использует PHP?","comment":"Динамической типизацией"},{"id":17,"type":"theory","index":" Есть ли разница между одинарными и двойными кавычками? Если есть, то какая?","comment":"Да есть, в PHP текст одинарной кавычки рассматривается как строковое значение, а текст двойной кавычки будет анализировать переменные"},{"id":18,"type":"theory","index":"ЧТО ТАКОЕ &laquo;echo&raquo; В PHP?","comment":"PHP echo выводит одну или несколько строк. Это языковая конструкция, а не функция. Таким образом, использование круглых скобок не требуется. Но если вы хотите передать в echo более одного параметра, необходимо использовать круглые скобки."},{"id":19,"type":"theory","index":" В ЧЕМ РАЗНИЦА МЕЖДУ &laquo;Echo&raquo; И &laquo;print&raquo; В PHP?","comment":"Echo может выводить одну или несколько строк, но print может выводить только одну строку и всегда возвращает 1 .\r\nEcho работает быстрее, чем print, потому что оно не возвращает никакого значения."},{"id":20,"type":"theory","index":"Что такое short tags и как его использовать в PHP?","comment":"Для обработки скрипта все содержимое кода необходимо заключать в открывающие и закрывающие теги &lt;?php и ?&gt;, которые определяют начало и конец обработки. short tags - это короткий синтаксис позволяющий использовать &lt;? и тем самым сократить запись, отбросив слово php и для вывода содержимого текст или переменной вместо echo использовать = (ровно)"},{"id":21,"type":"theory","index":"Что такое клиент и сервер?","comment":"Клиент &ndash; локальный компьютер на стороне виртуального пользователя, который выполняет отправку запроса к серверу для возможности предоставления данных или выполнения определенной группы системных действий.\r\nСервер &ndash; очень мощный компьютер или специальное системное оборудование, которое предназначается для разрешения определенного круга задач по процессу выполнения программных кодов. Он выполняет работы сервисного обслуживания по клиентским запросам, предоставляет пользователям доступ к определенным системным ресурсам, сохраняет данные или БД."},{"id":22,"type":"theory","index":"Что такое протокол? По какому протоколу общаются между  собой клиент и сервер?  ","comment":"Сетево́й протоко́л &mdash; набор правил и действий (очерёдности действий), позволяющий осуществлять соединение и обмен данными между двумя и более включёнными в сеть устройствами. Обшаются они между собой по протоколу HTTP и HTTPS\r\nHyperText Transfer Protocol (securety)\r\n\r\nTCP\/IP &ndash; совокупность протоколов передачи информации. TCP\/IP &ndash; это особое обозначение всей сети, которая функционирует на основе протоколов TCP, а также IP.\r\nTCP &ndash; вид протокола, который является связующим звеном для установки качественного соединения между 2 устройствами, передачи данных и верификации их получения.\r\nIP &ndash; протокол, в функции которого входит корректность доставки сообщений по выбранному адресу. При этом информация делится на пакеты, которые могут поставляться по-разному.\r\nMAC &ndash; вид протокола, на основании которого происходит процесс верификации сетевых устройств. Все устройства, которые подключены к сети Интернет, содержат свой оригинальный MAC-адрес.\r\nICMP &ndash; протокол, который ответственен за обмен данными, но не используется для процесса передачи информации.\r\nUDP &ndash; протокол, управляющий передачей данных, но данные не проходят верификацию при получении. Этот протокол функционирует быстрее, чем протокол TCP.\r\nHTTP &ndash; протокол для передачи информации (гипертекста), на базе которого функционируют все сегодняшние сайты. В его возможности входит процесс запрашивания необходимых данных у виртуально удаленной системы (файлы, веб-страницы и прочее).\r\nFTP &ndash; протокол передачи информации из особого файлового сервера на ПК конечного пользователя.\r\nPOP3 &ndash; классический протокол простого почтового соединения, который ответственен за передачу почты.\r\nSMTP &ndash; вид протокола, который может устанавливать правила для передачи виртуальной почты. Он ответственен за передачу и верификацию доставки, а также оповещения о возможных ошибках."},{"id":23,"type":"theory","index":"В чем разница между GET и POST ? ","comment":"HTTP методы GET и POST используются для отправки данных на сервер.\r\nЗапрос GET передает данные в URL в виде пар &quot;имя-значение&quot; ( через ссылку)\r\nPOST передает данные в теле запроса "},{"id":24,"type":"theory","index":"Что такое DNS?","comment":"DNS (Domain Name System) - DNS &mdash; компьютерная распределённая система для получения информации о доменах. Чаще всего используется для получения IP-адреса по имени хоста, получения информации о маршрутизации почты и\/или обслуживающих узлах для протоколов в домене"},{"id":25,"type":"theory","index":"Что такое переменная и константа? Чем они отличаются? Каким способом объявляется константа?","comment":"Пишем тут свой пост"},{"id":26,"type":"theory","index":"Что такое волшебные (магические) константы?","comment":"Волшебные константы - это список предопределенных в PHP констант. Существуют следующие волшебные константы\r\nИмя\t                    Описание\r\n__LINE__\t        Текущий номер строки в файле.\r\n__FILE__\t         Полный путь и имя текущего файла с развернутыми симлинками. Внутри подключаемого файла возвращается имя данного файла.\r\n__DIR__\t           Директория файла. Внутри подключаемого файла возвращается директория этого файла.\r\n__FUNCTION__\tИмя функции или {closure} в случае анонимной функции.\r\n__CLASS__\t               Имя класса, содержит название пространства имен, в котором класс был объявлен (например, Block\\Aside).\r\n__TRAIT__\t            Имя трейта, содержит название пространства имен, в котором трейт был объявлен (например, Block\\Aside).\r\n__METHOD__\tИмя метода класса.\r\n__NAMESPACE__\tИмя текущего пространства имен.\r\nClassName::class\tПолное имя класса (с указанием пространства имен)."},{"id":27,"type":"theory","index":"Что такое оператор?","comment":"Оператор  - это одно или несколько выражений, используемых для выполнения определенных действий.\r\nКакие существуют операторы?\r\nВ PHP есть следующие виды операторов:\r\n&bull;\tоператор присваивания\r\n&bull;\tарифметические операторы\r\n&bull;\tлогические операторы\r\n&bull;\tпобитовые операторы\r\n&bull;\tоператоры сравнения\r\n&bull;\tоператор управления ошибками\r\n&bull;\tоператоры инкремента и декремента\r\n&bull;\tстроковые операторы\r\n&bull;\tоператоры массивов\r\n&bull;\tоператор проверки типа"},{"id":28,"type":"theory","index":"Что такое арифметические операторы?","comment":"Арифметические операторы это простейшие математические операции: идентичность, отрицание, сложение, вычитание, умножение, деление, деление по модулю, возведение в степень."},{"id":29,"type":"theory","index":"Что такое логические операторы?","comment":"Логические операторы используются для проверки истинности или ложности каких-либо действий или условий. Есть следующие логические операторы:\r\nПример\t          \r\n$a and $b\t--               И;\r\n$a or $b\t--             Или;\r\n$a xor $b\t --        Исключающее или;\r\n! $a\t         --           Отрицание;\r\n$a &amp;&amp; $b\t  --             И;\r\n$a || $b\t   --          Или;"},{"id":30,"type":"theory","index":"Что такое оператор присваивания?","comment":"Оператор присваивания обозначается знаком = и позволяет указать для переменной новое значение.\r\nНапример:\r\n&lt;?php\r\n$a = 5;\r\n$a = 3;\r\necho $a;            \/\/выведет не 5, а 3, которое было присвоено переменной.\r\n?&gt;"},{"id":31,"type":"theory","index":"Что такое побитовые операторы? ","comment":"Побитовые операторы это операции производимые над цепочкой битов."},{"id":32,"type":"theory","index":"Что такое операторы сравнения?","comment":"Операторы сравнения используются для сравнения значений переменных между собой.Существуют следующие операторы сравнения:\r\nПример:\t\r\n$a == $b   --\tРавно; \r\n$a === $b ---\tТождественно равно;\r\n$a != $b  --\tНе равно; \r\n$a &lt;&gt; $b  --\tНе равно; \r\n$a !== $b  --\tТождественно не равно; \r\n$a &lt; $b\t-- Меньше; \r\n$a &gt; $b --\tБольше; \r\n$a &lt;= $b --\tМеньше или равно; \r\n$a &gt;= $b --\tБольше или равно; \r\n$a &lt;=&gt; $b\t-- Космический корабль (spaceship); "},{"id":33,"type":"theory","index":"Что такое оператор управления ошибками?","comment":"Оператор управления ошибками обозначается знаком @ и позволяет игнорировать вывод ошибок для используемых функций.\r\nНапример:\r\n&lt;?php\r\nif (@copy(&#039;\/uploads\/images\/bg.png&rsquo;)) {\r\n\/\/ файл скопирован\r\n}else {\r\n\/\/ файл не скопирован\r\n}\r\n?&gt;"},{"id":34,"type":"theory","index":"Что такое операторы исполнения?","comment":"Оператор исполнения позволяет выполнить строку, заключенную в кавычки `` и возвращает полученный вывод. Например:\r\n&lt;?php\r\n$output = `ls -al`;\r\necho &quot;&lt;pre&gt;$output&lt;\/pre&gt;&quot;;\r\n?&gt;"},{"id":35,"type":"theory","index":"Что такое операторы инкремента и декремента?","comment":"Операторы инкремента и декремента позволяют увеличить и уменьшить значение переменной на 1 (единицу). PHP поддерживает префиксные и постфиксные операторы инкремента и декремента в стиле C.Например:\r\n&lt;?php\r\n$i = 1;\r\n$i++; \/\/увеличит значение на 1\r\n?&gt;\r\n &lt;?php\r\n$i = 2;\r\n$i--; \/\/уменьшит значение на 1\r\n?&gt;"},{"id":36,"type":"theory","index":"Что работает быстрей: преинкремент или постинкремент?","comment":"Преинкремент работает быстрее, изменяя содержимое самой переменной, в то время как постинкремент создает временную переменную."},{"id":37,"type":"theory","index":"Продолжение следует","comment":"Пишем тут свой пост"}]